Revit 2026 API

# MarbleMarbleColor1 Property

---

The property labeled "Stone Color" from the "Marble" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MarbleColor1 { get; }
```
```vb
Public Shared ReadOnly Property MarbleColor1 As String
	Get
```
```cpp
public:
static property String^ MarbleColor1 {
	String^ get ();
}
```
```fsharp
static member MarbleColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Marble Class

Autodesk.Revit.DB.Visual Namespace